## Функции
### Зачем нужны функции?

Иногда некоторые куски программы удобно выделить в отдельные блоки и называть отдельным именем. Это необходимо, в основном, в двух случаях:
 - Мы делаем сложную задачу, и разбиваем ее на более простые. Например, рисовании фигур удобно разбить на рисования квадрата, пирамиды и лесенки. Каждую из них можно выделить в отдельную функцию.
 - Один и тот же код в программе используется много раз и постоянно копировать его неудобно. Например, в рисовании всех фигур используется вывод строки - его можно выделить в отдельную функции и повторно использовать. Функции можно выделять в отдельные файлы — библиотеки, и использовать их в разных программах.

У функций есть **входные данные** и **возвращаемое значение**.

**Входные данные, или параметры (аргументы)**, — это то, что понадобится функции для работы. Например, функции рисования квадрата нужны его размеры. А функции возведения числа в степень нужно два числа — число, которое нужно возвести в степень и сама степень.

**Возвращаемое значение** — это результат работы программы. Например, функция нахождения модуля числа должна вернуть модуль числа. Иногда у функции нет результата, то есть она ничего не возвращает, например, функция рисования квадрата на экран.

### Как определить функцию?
```
<тип возвращаемого значения> <название> (<тип аргумента> <аргумент>, <тип аргумента> <аргумент>, ...)
{
    <любой код>
    return <возвращаемое значение>;
}
```
Аргументов может быть сколь угодно много, они могут иметь разный тип. Все аргументы перечисляются в круглых скобках и через запятую.

Возвращаемое значение всегда одно. Это может быть название типа данных, либо слово void, если функция ничего не возвращает.

return возвращает в точку вызова (об этом дальше) возвращаемое значение и завершает выполнение функции.

**Например, сделаем функцию, которая находит наибольшее из двух чисел:**
```cpp
int max(int a, int b)
{
    if (a > b) return a;
    else return b;
}
```

Запись может сильно напомнить нам знакомый **main()**. Дело в том, что **main()** — тоже функция, которая по-умолчанию вызывается при запуске нашей программы. Это называется точкой входа в программу.

*На заметку: в функции main команда return немедленно завершает работу всей нашей программы.*

**Пользовательские функции определяются перед функцией main().**

### Вызов функций
```cpp
#include <iostream>

using namespace std;

int max(int a, int b)
{
   if (a > b) return a;
   else return b;
}

int main()
{
   int m, n;
   cin >> m >> n;
   cout << max(m, n);
   return 0;
}
```
На место *max(m, n)* компьютер подставит значение, которое нам вернула функция командой return.

**Обрати внимание!** На место переменных **a** и **b** в функции мы подставляем значения переменных **m** и **n**. То есть числа лежащие в переменных m и n **копируются** в переменные a и b. **Функция main не знает о существовании a и b, а max не знает ничего о переменных из функции main.** Рассмотрим пример:

```cpp
#include <iostream>

using namespace std;

void func()
{
   int a = 10; 
}

int main()
{
   func();
   cout << a; //тут будет ошибка, main не видит переменную a 
}
```
**Работает общее правило: все переменные, определенные внутри любых фигурных скобок видны и существуют только внутри этих скобок.**

### Вложенные вызовы функций

Вернемся к функциям, и решим с помощью нашей функции max задачку посложнее: вводится четыре числа, надо найти максимум.
```cpp
#include <iostream>

using namespace std;

int max(int a, int b)
{
   if (a > b) return a;
   else return b;
}

int main()
{
   int a, b, c, d; //так можно, a и b в функции - совсем другие переменные
   cin >> a >> b >> c >> d;
   cout << max(a, max(b, max(c, d)));
   return 0;
}
```

Давай рассмотрим еще один пример — вспомним задачку из урока про циклы, где нужно было вывести на экран квадрат из звездочек.

Выводя каждую строку, нам было бы удобно выделить функцию рисования n звездочек. Давай создадим ее:

```cpp
void DrawStars(int w) {
   for (int i = 0; i < w; i++) 
     cout << "*";
}
```
Теперь наша программа будет выглядеть проще для понимания:
```cpp
#include <iostream>
using namespace std;

void DrawStars(int w) {
   for (int i = 0; i < w; i++) 
     cout << "*";
} 

int main() {
   int n;
   cin >> n;
   for (int i = 0; i < n; i++) {
     DrawStars(n);
     cout << endl;
   }
}
```
А теперь давай сделаем программу, которая будет рисовать фигуру в зависимости от выбора пользователя. Например, если пользователь введет 1, рисовать квадрат, а если 2 — половинную пирамидку. Действуем:
```cpp
#include <iostream>
using namespace std;

void DrawStars(int w)
{
   for (int i = 0; i < w; i++)
     cout << "*";
} 

void DrawRectangle(int h) //функция рисования квадрата
{
   for (int i = 0; i < h; i++) { 
      DrawStars(h);
      cout << endl;
   }
}

void DrawTriangle(int h)
{
   for (int i = 1; i <= h; i++) {
      DrawStars(i);
      cout << endl;
   }
} 

int main()
{
   int a, n;
   cin >> a >> n;
   if (a == 1) DrawRectangle(n);
   else DrawTriangle(n);
}
```
